// ? Структура
// ? wrapper - width:100vh; overflow:hidden;
// ?  ul - position: relative - будет двигаться либо left либо transition
// ?   li

// !Переменные
// !ul
// !ulWidth - ширина списка
// !ulPosition - текущая позиция списка
// !позиция окна
// !

// Todo Запуск прокрутки в тот момент когда позиция окна нижним краем дойдёт до блока
// Todo Функция автоматической прокрутки
// Todo Если дошло до конца списка - запускаем обратную прокрутку
// Todo Если дошло до начала списка - запускаем прокрутку
// Todo Обработать события мыши(перетаскивание)
// Todo Обработать touch события (перетаскивание)
